jmeter/results/light-local-20260121-213722-html/statistics.json
{
  "GET /api/gateway/owners/{ownerId}" : {
    "transaction" : "GET /api/gateway/owners/{ownerId}",
    "sampleCount" : 13,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 240.84615384615384,
    "medianResTime" : 231.0,
    "minResTime" : 180.0,
    "maxResTime" : 357.0,
    "pct1ResTime" : 339.79999999999995,
    "pct2ResTime" : 357.0,
    "pct3ResTime" : 357.0,
    "throughput" : 0.08480491607575036,
    "receivedKBytesPerSec" : 0.042166747258518,
    "sentKBytesPerSec" : 0.014665032812979066
  },
  "GET /api/vet/vets" : {
    "transaction" : "GET /api/vet/vets",
    "sampleCount" : 54,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 307.4444444444445,
    "medianResTime" : 300.5,
    "minResTime" : 268.0,
    "maxResTime" : 420.0,
    "pct1ResTime" : 370.5,
    "pct2ResTime" : 390.75,
    "pct3ResTime" : 420.0,
    "throughput" : 0.3116109710144091,
    "receivedKBytesPerSec" : 0.23794035787654433,
    "sentKBytesPerSec" : 0.05142798252093275
  },
  "POST /api/customer/owners" : {
    "transaction" : "POST /api/customer/owners",
    "sampleCount" : 39,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 172.20512820512818,
    "medianResTime" : 169.0,
    "minResTime" : 126.0,
    "maxResTime" : 255.0,
    "pct1ResTime" : 226.0,
    "pct2ResTime" : 248.0,
    "pct3ResTime" : 255.0,
    "throughput" : 0.23315318762255488,
    "receivedKBytesPerSec" : 0.06096801728621647,
    "sentKBytesPerSec" : 0.07804466677029032
  },
  "GET /api/visit/owners/*/pets/{petId}/visits" : {
    "transaction" : "GET /api/visit/owners/*/pets/{petId}/visits",
    "sampleCount" : 40,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 152.17500000000004,
    "medianResTime" : 135.0,
    "minResTime" : 84.0,
    "maxResTime" : 263.0,
    "pct1ResTime" : 243.09999999999997,
    "pct2ResTime" : 252.79999999999998,
    "pct3ResTime" : 263.0,
    "throughput" : 0.2339550689290122,
    "receivedKBytesPerSec" : 0.0434324791048879,
    "sentKBytesPerSec" : 0.04324970170728711
  },
  "POST /api/customer/owners/{ownerId}/pets" : {
    "transaction" : "POST /api/customer/owners/{ownerId}/pets",
    "sampleCount" : 26,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 364.84615384615387,
    "medianResTime" : 370.0,
    "minResTime" : 230.0,
    "maxResTime" : 562.0,
    "pct1ResTime" : 461.90000000000003,
    "pct2ResTime" : 539.9499999999999,
    "pct3ResTime" : 562.0,
    "throughput" : 0.15852305291011742,
    "receivedKBytesPerSec" : 0.03595705816271781,
    "sentKBytesPerSec" : 0.04257210893582255
  },
  "POST /api/visit/owners/*/pets/{petId}/visits" : {
    "transaction" : "POST /api/visit/owners/*/pets/{petId}/visits",
    "sampleCount" : 13,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 169.84615384615384,
    "medianResTime" : 165.0,
    "minResTime" : 136.0,
    "maxResTime" : 261.0,
    "pct1ResTime" : 232.59999999999997,
    "pct2ResTime" : 261.0,
    "pct3ResTime" : 261.0,
    "throughput" : 0.083983668406636,
    "receivedKBytesPerSec" : 0.017450332543025478,
    "sentKBytesPerSec" : 0.023386978574474134
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 344,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 433.142441860465,
    "medianResTime" : 251.0,
    "minResTime" : 84.0,
    "maxResTime" : 2122.0,
    "pct1ResTime" : 1144.5,
    "pct2ResTime" : 1402.75,
    "pct3ResTime" : 2009.400000000001,
    "throughput" : 1.9228404377815786,
    "receivedKBytesPerSec" : 3.555411971358621,
    "sentKBytesPerSec" : 0.3896326183469162
  },
  "GET /api/customer/owners/{ownerId}" : {
    "transaction" : "GET /api/customer/owners/{ownerId}",
    "sampleCount" : 78,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 180.00000000000003,
    "medianResTime" : 178.0,
    "minResTime" : 101.0,
    "maxResTime" : 368.0,
    "pct1ResTime" : 237.3,
    "pct2ResTime" : 267.15,
    "pct3ResTime" : 368.0,
    "throughput" : 0.45124004234714243,
    "receivedKBytesPerSec" : 0.2086375045557889,
    "sentKBytesPerSec" : 0.07851730404322649
  },
  "GET /api/customer/owners" : {
    "transaction" : "GET /api/customer/owners",
    "sampleCount" : 81,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1120.1358024691363,
    "medianResTime" : 1038.0,
    "minResTime" : 561.0,
    "maxResTime" : 2122.0,
    "pct1ResTime" : 1746.3999999999999,
    "pct2ResTime" : 1960.6,
    "pct3ResTime" : 2122.0,
    "throughput" : 0.45276184726833685,
    "receivedKBytesPerSec" : 2.9406375417826522,
    "sentKBytesPerSec" : 0.0778184424992454
  }
}