jmeter/results/light-local-20260121-215316-html/statistics.json
{
  "GET /api/gateway/owners/{ownerId}" : {
    "transaction" : "GET /api/gateway/owners/{ownerId}",
    "sampleCount" : 12,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 283.9166666666667,
    "medianResTime" : 249.0,
    "minResTime" : 215.0,
    "maxResTime" : 608.0,
    "pct1ResTime" : 535.4000000000003,
    "pct2ResTime" : 608.0,
    "pct3ResTime" : 608.0,
    "throughput" : 0.07601431602951889,
    "receivedKBytesPerSec" : 0.06340093790580559,
    "sentKBytesPerSec" : 0.013145379358945934
  },
  "GET /api/vet/vets" : {
    "transaction" : "GET /api/vet/vets",
    "sampleCount" : 49,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 360.5714285714286,
    "medianResTime" : 351.0,
    "minResTime" : 289.0,
    "maxResTime" : 446.0,
    "pct1ResTime" : 417.0,
    "pct2ResTime" : 432.0,
    "pct3ResTime" : 446.0,
    "throughput" : 0.2847496237237115,
    "receivedKBytesPerSec" : 0.2174950041695481,
    "sentKBytesPerSec" : 0.04699481094658911
  },
  "POST /api/customer/owners" : {
    "transaction" : "POST /api/customer/owners",
    "sampleCount" : 36,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 157.80555555555554,
    "medianResTime" : 153.5,
    "minResTime" : 108.0,
    "maxResTime" : 312.0,
    "pct1ResTime" : 215.40000000000003,
    "pct2ResTime" : 258.44999999999993,
    "pct3ResTime" : 312.0,
    "throughput" : 0.21439291074108482,
    "receivedKBytesPerSec" : 0.05602922368922557,
    "sentKBytesPerSec" : 0.07173182945639486
  },
  "GET /api/visit/owners/*/pets/{petId}/visits" : {
    "transaction" : "GET /api/visit/owners/*/pets/{petId}/visits",
    "sampleCount" : 37,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 131.45945945945948,
    "medianResTime" : 127.0,
    "minResTime" : 95.0,
    "maxResTime" : 231.0,
    "pct1ResTime" : 161.20000000000005,
    "pct2ResTime" : 197.70000000000005,
    "pct3ResTime" : 231.0,
    "throughput" : 0.21479533487753763,
    "receivedKBytesPerSec" : 0.053250965490517076,
    "sentKBytesPerSec" : 0.03970720348084548
  },
  "POST /api/customer/owners/{ownerId}/pets" : {
    "transaction" : "POST /api/customer/owners/{ownerId}/pets",
    "sampleCount" : 23,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 295.9130434782608,
    "medianResTime" : 288.0,
    "minResTime" : 231.0,
    "maxResTime" : 389.0,
    "pct1ResTime" : 369.40000000000003,
    "pct2ResTime" : 388.2,
    "pct3ResTime" : 389.0,
    "throughput" : 0.14577629043707535,
    "receivedKBytesPerSec" : 0.033132663158528544,
    "sentKBytesPerSec" : 0.03914890612323801
  },
  "POST /api/visit/owners/*/pets/{petId}/visits" : {
    "transaction" : "POST /api/visit/owners/*/pets/{petId}/visits",
    "sampleCount" : 12,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 172.5,
    "medianResTime" : 169.0,
    "minResTime" : 110.0,
    "maxResTime" : 245.0,
    "pct1ResTime" : 238.70000000000002,
    "pct2ResTime" : 245.0,
    "pct3ResTime" : 245.0,
    "throughput" : 0.0768521364893944,
    "receivedKBytesPerSec" : 0.016010861768623832,
    "sentKBytesPerSec" : 0.021414527615534376
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 312,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 620.8108974358984,
    "medianResTime" : 237.0,
    "minResTime" : 95.0,
    "maxResTime" : 2869.0,
    "pct1ResTime" : 2017.6999999999996,
    "pct2ResTime" : 2351.2499999999995,
    "pct3ResTime" : 2761.3100000000004,
    "throughput" : 1.7558867227950115,
    "receivedKBytesPerSec" : 6.126367741490704,
    "sentKBytesPerSec" : 0.3561973357092207
  },
  "GET /api/customer/owners/{ownerId}" : {
    "transaction" : "GET /api/customer/owners/{ownerId}",
    "sampleCount" : 71,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 150.67605633802822,
    "medianResTime" : 136.0,
    "minResTime" : 104.0,
    "maxResTime" : 319.0,
    "pct1ResTime" : 198.39999999999998,
    "pct2ResTime" : 223.79999999999978,
    "pct3ResTime" : 319.0,
    "throughput" : 0.40812337972144147,
    "receivedKBytesPerSec" : 0.2741405338368771,
    "sentKBytesPerSec" : 0.07098822980795208
  },
  "GET /api/customer/owners" : {
    "transaction" : "GET /api/customer/owners",
    "sampleCount" : 72,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1979.1527777777774,
    "medianResTime" : 1914.5,
    "minResTime" : 1423.0,
    "maxResTime" : 2869.0,
    "pct1ResTime" : 2603.2000000000003,
    "pct2ResTime" : 2702.5499999999993,
    "pct3ResTime" : 2869.0,
    "throughput" : 0.40520462833731036,
    "receivedKBytesPerSec" : 5.442947663179281,
    "sentKBytesPerSec" : 0.06964454549547522
  }
}